## Pandas Operations

In [182]:
import numpy as np
import pandas as pd

In [183]:
df = pd.DataFrame({'col1':[1,2,3,4], 'col2':[111,222,333,444], 'col3':['abc','efg','hij','klm']})

In [184]:
df.head()

   col1  col2 col3
0     1   111  abc
1     2   222  efg
2     3   333  hij
3     4   444  klm

In [185]:
df.reset_index()

   index  col1  col2 col3
0      0     1   111  abc
1      1     2   222  efg
2      2     3   333  hij
3      3     4   444  klm

In [186]:
newing = 'AA BB CC DD'.split()

In [187]:
newing

['AA', 'BB', 'CC', 'DD']

In [188]:
df['Num'] = newing

In [189]:
df

   col1  col2 col3 Num
0     1   111  abc  AA
1     2   222  efg  BB
2     3   333  hij  CC
3     4   444  klm  DD

In [190]:
df.reset_index()

   index  col1  col2 col3 Num
0      0     1   111  abc  AA
1      1     2   222  efg  BB
2      2     3   333  hij  CC
3      3     4   444  klm  DD

In [191]:
df['col2'].unique()

array([111, 222, 333, 444])

In [192]:
len(df['col2'].unique()) #length

4

In [193]:
df['col2'].nunique()

4

In [194]:
df['col2'].value_counts()

111    1
222    1
333    1
444    1
Name: col2, dtype: int64

In [195]:
df[df['col1']>2]

   col1  col2 col3 Num
2     3   333  hij  CC
3     4   444  klm  DD

In [196]:
df['col1']>2    #command inside is boolean series

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [197]:
df[df['col1']==111 & (df['col2']>2)]

   col1  col2 col3 Num
0     1   111  abc  AA

In [198]:
df['col2'] >2

0    True
1    True
2    True
3    True
Name: col2, dtype: bool

In [199]:
df[df['col1']>2 & (df['col2']==333)]

   col1  col2 col3 Num
0     1   111  abc  AA
1     2   222  efg  BB
2     3   333  hij  CC
3     4   444  klm  DD

In [200]:
def times2(x):
    return x*2

In [201]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [202]:
df['Num'].apply(len)

0    2
1    2
2    2
3    2
Name: Num, dtype: int64

In [203]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [204]:
df.drop('col1', axis=1)

   col2 col3 Num
0   111  abc  AA
1   222  efg  BB
2   333  hij  CC
3   444  klm  DD

In [205]:
df

   col1  col2 col3 Num
0     1   111  abc  AA
1     2   222  efg  BB
2     3   333  hij  CC
3     4   444  klm  DD

In [206]:
df.columns

Index(['col1', 'col2', 'col3', 'Num'], dtype='object')

In [207]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [208]:
df.sort_values('col2')

   col1  col2 col3 Num
0     1   111  abc  AA
1     2   222  efg  BB
2     3   333  hij  CC
3     4   444  klm  DD

In [209]:
df.sort_values(by='col2')  #index stayes attached to the row, information is not lost

   col1  col2 col3 Num
0     1   111  abc  AA
1     2   222  efg  BB
2     3   333  hij  CC
3     4   444  klm  DD

In [210]:
df.isnull()              # to find null value

    col1   col2   col3    Num
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False

In [211]:
data = {
    'A': ['A4', 'A5', 'A6', 'A7', 'A8', 'A9'],
    'B': ['B4', 'B5', 'B6', 'B7', 'B8', 'B9'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1,3,2,5,4,1]
}
df = pd.DataFrame(data)

In [212]:
df

    A   B  C  D
0  A4  B4  x  1
1  A5  B5  y  3
2  A6  B6  x  2
3  A7  B7  y  5
4  A8  B8  x  4
5  A9  B9  y  1

In [213]:
df.pivot_table(values='D', index=['A','B'],columns=['C'])

C        x    y
A  B
A4 B4  1.0  NaN
A5 B5  NaN  3.0
A6 B6  2.0  NaN
A7 B7  NaN  5.0
A8 B8  4.0  NaN
A9 B9  NaN  1.0

In [214]:
df.pivot_table(values='A', index=['A','B'],columns=['B'])

/var/folders/7g/3l3vrvmn4qn6_tgpd8pkh8_w0000gn/T/ipykernel_14554/3522225622.py:1: FutureWarning: pivot_table dropped a column because it failed to aggregate. This behavior is deprecated and will raise in a future version of pandas. Select only the columns that can be aggregated.
  df.pivot_table(values='A', index=['A','B'],columns=['B'])

B       B4   B5   B6   B7   B8   B9
A  B
A4 B4  1.0  NaN  NaN  NaN  NaN  NaN
A5 B5  NaN  3.0  NaN  NaN  NaN  NaN
A6 B6  NaN  NaN  2.0  NaN  NaN  NaN
A7 B7  NaN  NaN  NaN  5.0  NaN  NaN
A8 B8  NaN  NaN  NaN  NaN  4.0  NaN
A9 B9  NaN  NaN  NaN  NaN  NaN  1.0

## Data Input & Output

In [215]:
import pandas as pd

In [216]:
pwd

'/Users/pb/Desktop/git/AI_Project'

In [222]:
pd.read_csv('intro.md')

Empty DataFrame
Columns: [Vdldv]
Index: []

In [221]:
df = pd.read_csv('intro.md')

In [219]:
df.to_csv('My_Output')

In [220]:
df.to_csv('My_Output',index=False)

In [223]:
conda install xlrd

Retrieving notices: ...working... DEBUG:urllib3.connectionpool:Starting new HTTPS connection (1): repo.anaconda.com:443
DEBUG:urllib3.connectionpool:Starting new HTTPS connection (1): repo.anaconda.com:443
DEBUG:urllib3.connectionpool:https://repo.anaconda.com:443 "GET /pkgs/main/notices.json HTTP/1.1" 404 None
DEBUG:urllib3.connectionpool:https://repo.anaconda.com:443 "GET /pkgs/r/notices.json HTTP/1.1" 404 None
done
Collecting package metadata (current_repodata.json): / DEBUG:urllib3.connectionpool:Starting new HTTPS connection (1): repo.anaconda.com:443
DEBUG:urllib3.connectionpool:Starting new HTTPS connection (1): repo.anaconda.com:443
DEBUG:urllib3.connectionpool:Starting new HTTPS connection (1): repo.anaconda.com:443
DEBUG:urllib3.connectionpool:Starting new HTTPS connection (1): repo.anaconda.com:443
DEBUG:urllib3.connectionpool:https://repo.anaconda.com:443 "GET /pkgs/main/noarch/current_repodata.json HTTP/1.1" 200 None
DEBUG:urllib3.connectionpool:https://repo.anaconda.com:443 "GET /pkgs/r/noarch/current_repodata.json HTTP/1.1" 304 0
- DEBUG:urllib3.connectionpool:https://repo.anaconda.com:443 "GET /pkgs/main/osx-arm64/current_repodata.json HTTP/1.1" 200 None
DEBUG:urllib3.connectionpool:https://repo.anaconda.com:443 "GET /pkgs/r/osx-arm64/current_repodata.json HTTP/1.1" 304 0
done
Solving environment: done

## Package Plan ##

  environment location: /Users/pb/anaconda3

  added / updated specs:
    - xlrd


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ca-certificates-2024.3.11  |       hca03da5_0         128 KB
    certifi-2024.2.2           |  py311hca03da5_0         161 KB
    xlrd-2.0.1                 |     pyhd3eb1b0_1          97 KB
    ------------------------------------------------------------
                                           Total:         387 KB

The following NEW packages will be INSTALLED:

  xlrd               pkgs/main/noarch::xlrd-2.0.1-pyhd3eb1b0_1

The following packages will be UPDATED:

  ca-certificates                     2023.12.12-hca03da5_0 --> 2024.3.11-hca03da5_0
  certifi                        2023.11.17-py311hca03da5_0 --> 2024.2.2-py311hca03da5_0



Downloading and Extracting Packages
certifi-2024.2.2     | 161 KB    |                                       |   0%
xlrd-2.0.1           | 97 KB     |                                       |   0%

ca-certificates-2024 | 128 KB    |                                       |   0% DEBUG:urllib3.connectionpool:Starting new HTTPS connection (1): repo.anaconda.com:443
DEBUG:urllib3.connectionpool:Starting new HTTPS connection (1): repo.anaconda.com:443
DEBUG:urllib3.connectionpool:Starting new HTTPS connection (1): repo.anaconda.com:443
DEBUG:urllib3.connectionpool:https://repo.anaconda.com:443 "GET /pkgs/main/osx-arm64/ca-certificates-2024.3.11-hca03da5_0.conda HTTP/1.1" 200 131547
DEBUG:urllib3.connectionpool:https://repo.anaconda.com:443 "GET /pkgs/main/noarch/xlrd-2.0.1-pyhd3eb1b0_1.conda HTTP/1.1" 200 99161

xlrd-2.0.1           | 97 KB     | ########################4             |  66% DEBUG:urllib3.connectionpool:https://repo.anaconda.com:443 "GET /pkgs/main/osx-arm64/certifi-2024.2.2-py311hca03da5_0.conda HTTP/1.1" 200 165322
certifi-2024.2.2     | 161 KB    | ###6                                  |  10%

ca-certificates-2024 | 128 KB    | ####################################8 | 100%
xlrd-2.0.1           | 97 KB     | ##################################### | 100%





Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [ ]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

In [226]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

In [227]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [229]:
data[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Republic First Bank dba Republic Bank,Philadelphia,PA,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
...,...,...,...,...,...,...,...
564,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
565,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
566,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
567,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
568,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [230]:
from sqlalchemy import create_engine

In [231]:
engine = create_engine('sqlite:///:memory:')

In [232]:
df.to_sql('my_table',engine)

0

In [233]:
sqlldf = pd.read_sql('my_table',con=engine)

In [ ]:
sqldf